Autodesk.Revit.DB.ExtensibleStorage.Field.SubEntityWriteAccessGranted
Checks whether there is write access to subentities storable in this field.
Returns:
True if subentities are writable.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.SubEntityReadAccessGranted
Checks whether there is read access to subentities storable in this field.
Returns:
True if subentities are readable.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.CompatibleDisplayUnitType(Autodesk.Revit.DB.DisplayUnitType)
Checks if the specified type is compatible with the field description.
type:
The type to check.
Returns:
True if the type is compatible, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExtensibleStorage.Field.SubSchema
The Schema describing the subentity (or subentities) stored in this Field.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.KeyType
The type of the keys stored in the field.
Remarks:
For key-value maps, this is the key type. For all other field, this is NULL.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.ValueType
The type of the values stored in the field.
Remarks:
For key-value maps, this is the value type.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.Documentation
The overall description of the Field.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.ContainerType
Reports whether this is a simple field containing one value,
or a container of multiple values.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.SubSchemaGUID
The GUID of the Schema describing the subentity (or subentities) stored in this Field.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.UnitType
The type of units represented by values stored in this field
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.Schema
The Schema to which this Field belongs.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field.FieldName
The name of the field.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Field
The description of a field within a Schema in the Extensible Storage framework. Contains
the field's name, type, access control and documentation.
Since:
2012